// 第一节 APDU指令

/*		在 git remote add jason git@github.com:MakeLinuxYeah/CPUCard.git时
 *	出现错误：fatal: Not a git repository (or any of the parent directories): .git
 *	只需要git init一下，接着再次执行即可。
 *
 *		在出现"error: 无法推送一些引用到 'git@github.com:MakeLinuxYeah/CPUCard.git'
 *	提示：更新被拒绝，因为远程仓库包含您本地尚不存在的提交"时，使用命令
 *		git push -u jason +master
 *	强行提交即可.
 */

/*
 *	前言 
 *		APDU指令，即 Application Protocol data unit, 是智能卡与智能卡读卡器之间传
 *	送的信息单元。
 *	
 *	一、命令分类：
 *		COS命令由具体应用可分为4中命令报文结构：
 *	  1）CLA  INS  P1  P2  00
 *	  2）CLA  INS  P1  P2  Le
 *	  3）CLA  INS  P1  P2  Lc  Data
 *	  4）CLA  INS  P1  P2  Lc  Data  Le
 *
 *	二、响应报文
 *		响应数据  响应状态码
 *		  Data    SW1  SW2
 *
 *		Data：返回给用户的数据，即命令的执行结果
 *		SW1、SW2：返回命令处理的状态
 *
 *
 *	三、命令集
 *	  1）Read Binary
 *		功能：用于读取二进制文件部分或全部内容。
 *		命令报文：
 *					表1 Read Binary命令报文
 *		--------------------------------------------------------------
 *		|代码 |                         值                           |
 *		--------------------------------------------------------------
 *		|CLA  |         "00"或"04"                                   |
 *		|INS  |             "B0"                                     |				
 *		|P1   |             见表2                                    |
 *		|P2   |     从文件中读取的第一个字节的偏移地址               |
 *		|Lc   |     不存在;(CLA=04时例外)                            |
 *		|Data |     不存在;(CLA=04时，应包括MAC)                     |
 *		|Le   |             "00"                                     |
 *		--------------------------------------------------------------
 *
 *					表2 命令引用控制参数(P1)
 *		--------------------------------------------------------------
 *		|bit8|bit7|bit6|bit5|bit4|bit3|bit2|bit1|    含义            |
 *		--------------------------------------------------------------
 *		| X  |    |    |    |    |    |    |    |   读取模式：       |	
 *		| 1  |    |    |    |    |    |    |    |   用SFI模式        | 
 *		|    | 0  | 0  |    |    |    |    |    |   RFU模式(若bit8=1)| 
 *		|    |    |    | X  | X  | X  | X  | X  | SFI(取值范围21-30) |    	
 *		--------------------------------------------------------------
 *	
 *	 注：SFI，短文见标识符
 *	     RFU，预留
 *		例：读取0015文件
 *			00 B0 95 00 2B
 *		  95,命令引用控制参数
 *		  00,偏移地址
 *		  2B，读取长度为43个字节
 *
 *
 *	  2)Update Binary
 *		功能：使用给定的数据来更新二进制文件或全部的内容。
 *		命令报文：
 *				 表3 Update Binary命令报文
 *		--------------------------------------------------------------
 *		|代码 |                         值                           |
 *		--------------------------------------------------------------
 *		|CLA  |         "00"或"04"                                   |
 *		|INS  |             "D6"                                     |              
 *		|P1   |             见表2                                    |
 *		|P2   |     要修改的第一个字节的偏移地址                     |
 *		|Lc   |              后续数据域长度                          |
 *		|Data |   修改用的数据+报文鉴别码（MAC）数据元（4字节）      |
 *		|Le   |             不存在                                   |
 *		--------------------------------------------------------------
 *		CLA=00,不需要安全报文
 *		CLA=04,需要安全报文
 *	 3) Read Record
 *		功能：读取记录文件的内容。
 *				表4 Read Record命令报文
 *		--------------------------------------------------------------
 *		|代码 |                         值                           |
 *		--------------------------------------------------------------
 *		|CLA  |         "00"或"04"                                   |
 *		|INS  |             "B2"                                     |              
 *		|P1   |             记录号                                   |
 *		|P2   |     引用控制参数（见表5）                            |
 *		|Lc   |     不存在;(CLA=04时例外)                            |
 *		|Data |     不存在;(CLA=04时例外)                            |
 *		|Le   |             "00"                                     |
 *		--------------------------------------------------------------
 *
 *				表5 Read Record命令引用控制参数
 *		--------------------------------------------------------------
 *		|Bit8|Bit7|Bit6|Bit5|Bit4|Bit3|Bit2|Bit1|Bit0|   含义        |
 *		--------------------------------------------------------------
 *		|X   |X   |X   |X   |X   |X   |    |    |    |   SFI         |
 *		|    |    |    |    |    |    |  1 | 0  | 0  |   P1为记录号  |
 *		--------------------------------------------------------------
 *		
 *		例：读取0019文件(变长记录文件)
 *			00 B2 01 CC 2B
 *		    
 *
 *	 4)Select命令
 *		功能：通过文件名来选择IC卡中的文件
 *				表6 Select命令报文
 *		--------------------------------------------------------------
 *      |代码 |                         值                           |
 *      --------------------------------------------------------------
 *      |CLA  |         "00"                                         |
 *      |INS  |         "A4"                                         |              
 *      |P1   |     引用控制参数（见表7）                            |
 *      |P2   |     "00"第一个或仅有一个;"02"下一个。                |
 *      |Lc   |     "05"——"10"                                       |
 *      |Data |         文件名                                       |
 *      |Le   |             "00"                                     |
 *      --------------------------------------------------------------
 *       
 *				表7 Select命令引用控制参数
 *		--------------------------------------------------------------
 *		|Bit8|Bit7|Bit6|Bit5|Bit4|Bit3|Bit2|Bit1|Bit0|   含义        |
 *		--------------------------------------------------------------
 *		| 0  | 0  | 0  | 0  | 0  | 0  |    |    |    |               |
 *		|    |    |    |    |    |    | 1  |    |    |通过文件名选择 |
 *		|    |    |    |    |    |    |    | 0  | 0  |               |    
 *		--------------------------------------------------------------
 *		例：进入DF01(1001)目录
 *			00 A4 00 00 02 1001
 *			进入0019文件目录
 *			00 A4 00 00 02 0019
 *
 *
